{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 60, 20, 3], "data_format": "channels_last", "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "dtype": "float32", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_4", "rate": 0.25, "seed": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_5", "rate": 0.25, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "units": 1024, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_6", "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "units": 2, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "bias_constraint": null}}], "keras_version": "2.0.9"}